;---------------------------------BEGIN: EMCC\Caliset-----------------------------------------
[CALISET_DLG_102]
CAPTION=HL校正軟體
ID1022=方案集
ID1023=請選擇:
ID1007=另存為
ID1017=刪除
ID1084=導入
ID1085=導出

ID1075=校正頭
ID1024=基本參數
ID1025=校正範圍(mm):
ID1026=打標範圍(mm):
ID1072=坐標系
ID1077=旋轉角度
ID1079=X偏移(mm)
ID1080=Y偏移(mm)
ID1119=振鏡1=X
ID1120=振鏡2=X
ID1116=反向
ID1117=反向

ID1030=網格及級別校正（选中缩放比例后双击可弹出自动计算窗口）
ID1009=添加級別
ID1010=刪除級別
ID1012=多級整體效果
ID1031=回字級數:
ID1018=最大級別打標TEXT圖形, 其他級別打標回字圖形

ID1053=紅光校正
ID1043=啟用
ID1054=X縮放比:
ID1055=Y縮放比:
ID1056=X偏移量(mm):
ID1057=Y偏移量(mm):

ID1058=調焦
ID1065=聚焦方式
ID1059=動態調焦類型
ID1060=控制模式
ID1061=振鏡軸間距(mm)
ID1082=方頭到工作平面高度(mm)
ID1063=微調值(um)
ID1062=動態調焦補償係數

ID1011=測試 F7
ID1037=停止
ID1014=參數>>

ID1109=校正類型
ID1099=普通校正
ID1100=高精度校正1[掃描器]
ID1101=高精度校正[导入网格点真实数据]
ID1110=高精度校正說明：1、首先選擇普通校正進行常規的校正，對坐標系、紅光校正、BOX大小及變形進行初步調整。2、選擇高精度校正，生成網格點。3、用不同的工具獲得資料並進行處理後，將資料導入。
ID1114=直接導入高精度校正數據


ID1089=高精度校正
ID1086=生成網格點
ID1111=第一步:生成網格點。
ID1112=第二步:導入掃描器或二次元獲取資料。
ID1113=第三步:創建高精度校正表。

ID1096=縮放
ID1027=有效打標範圍(mm)
ID1097=凹凸
ID1028=測試BOX大小(mm):
ID1091=導入掃描器處理後資料
ID1087=導入資料
ID1016=創建高精度校正表

ID1139=生成校正錶
ID1=確定
ID2=取消
ID1142 = 打標控制

[CALISET_DLG_167]
CAPTION=高精度資料導入
ID1114=二次元獲取的X座標文件：
ID1115=二次元獲取的Y座標文件：
ID1=確定
ID2=取消

[CALISET_DLG_159]
CAPTION=保存方案
ID1036=校正方案另存為:
ID1=確定
ID2=取消

[CALISET_DLG_131]
CAPTION=打標參數
ID1032=打標次數:
ID1033=打標速度(mm/s)
ID1035=功率(%)
ID1034=Q頻(KHz)
ID1036=Q釋放時間(us)
ID1037=鐳射關延時(us)

ID1=確定
ID2=取消

[CALISET_DLG_160]
CAPTION=設置點陣打標行列資訊
ID1093=行數
ID1094=列數
ID1116=僅設置行列數,不打標
ID1=打標
ID2=取消
ID1099=點
ID1100=十字
ID1101=圓

[CALISET_DLG_164]
CAPTION=選擇控制卡
ID1098=請選擇工作卡：
ID1=確定
ID2=取消


[CALISET_STRINGTABLE]
ID0=BOX大小(mm)
ID1=X縮放比例％
ID2=Y縮放比例％
ID3=X凹凸
ID4=Y凹凸
ID5=X梯形
ID6=Y梯形
ID7=X平行
ID8=Y平行
ID9=X正向比例％
ID10=X負向比例％
ID11=Y正向比例％
ID12=Y負向比例％
ID13=參數\級別
ID14=電流(A)
ID15=功率(%)
ID16=電流(%)
ID17=雷射脈寬(ns)
ID18=雷射模式
ID999=已經有打標軟體或校正軟體正在運行,請先關閉!
ID1000=打標庫檔丟失或損壞，請確認軟體是否正常!
ID1001=打標控制卡初始化失敗!
ID1002=打標控制卡系統設置失敗!
ID1003=請先選擇要測試的校正級別!
ID1004=操作失敗，請稍後再試!
ID1005=已存在該方案名，覆蓋嗎?	
ID1006=校正範圍不能為0!	
ID1007=打標範圍不能為0!
ID1008=校正範圍和打標範圍的比例係數不對，校正範圍必須是打標範圍的%.3f倍上!
ID1011=請選擇要刪除級別
ID1012=請至少保留一級校正!
ID1013=檔錯誤!
ID1014=設定校正資料到卡失敗，請稍後重試!	
ID1015=該校正配置方案與當前軟體版本不一致，是否強制讀入嗎?
ID1016=BOX大小不能超出打標範圍!
ID1017=BOX大小不能超出上一級大小!
ID1018=當前校正設置已經修改，保存嗎?
ID1019=讀取檔失敗!
ID1020=確認刪除當前方案嗎?
ID1021=沒有檢測到軟體狗!
ID1022=檢測到軟體狗，但不是合法的軟體狗!
ID1023=插入的合法軟體狗多於1個!
ID1024=將初始狗轉換成運行狗失敗!
ID1025="當前軟體授權已到期，需要聯繫大族客服人員，重新申請與（狗ID=%s，校驗碼=%s）匹配的許可授權補丁，以便繼續使用"
ID1026="D160"
ID1027="D480"
ID1028="CO2增強"
ID1029="CO2傳統"
ID1030="打標失敗"
ID1031=BOX大小不能小於下一級大小!
ID1032=超出有效校正區域
ID1033="fθ後聚焦"
ID1034="3D動態調焦"
ID1035="普通後聚焦"
ID1036="簡便雷射器控制模式下BOX大小必須小於打標範圍%dmm"
ID1037="獲取卡內保存的狗ID失敗,請檢查卡是否被綁定過"
ID1038="導入失敗"
ID1039="導入成功"
ID1040="導出失敗"
ID1041="導出成功"
ID1042="操作失敗"
ID1043="檔資料不匹配"
ID1044="后聚焦3D"
ID1045="X坐標文件路徑為空!"
ID1046="Y坐標文件路徑為空!"
ID1047="卡上的狗號跟加密狗狗號不壹致" 
ID1048="卡上的卡號為空或長度不對"

;---------------------------------End: EMCC\Caliset-----------------------------------------

[error]
1=卡未初始化或找不到卡！
2=複位失敗！
3=卡版本不對！
4=報警！
6=執行失敗！
7=狀態不對應！
16=命令超時！
17=命令丟失！
18=介面調用異步！
19=介面被其它程式佔用！
20=Z軸超限或校正文件損壞！
21=參數不匹配！
23=記憶體分配失敗！
100=離線使用中！
101=命令被中止！
1001=埠1
1002=埠2
1003=埠3
1004=埠4
1005=埠5
1006=埠6
1007=埠7
1008=激光輸入沒有準備好
1009=激光輸入準備就緒

[4]
1 = 雷射器過溫，請關閉電源！
2 = 激光器高反報警，請關閉電源！
3 = 雷射器MO異常，請關閉電源！
4 = 雷射器蓋子被打開，請關閉電源並裝好雷射器蓋子！
5 = 安全門被打開，請關上安全門！
6 = 光閘關閉異常，請關閉電源並檢查光閘！
7 = 光閘打開異常，請關閉電源並檢查光閘！
8 = 安全門被打開，打標暫停，請關上安全門繼續打標！
9 = 安全門被打開，打標中止！
10= 雷射器系統報警，請關閉電源！
11= 雷射器電源電壓超範圍，請關閉電源！
12= 雷射器電源過壓報警，請關閉電源並檢查雷射器電源！
13= 雷射器電源欠壓報警，請關閉電源並檢查雷射器電源！
14= SPI激光器過溫報警，請關閉電源！
15= SPI激光器預備放大器過流報警，請關閉電源！
16= SPI雷射器功率放大器過流報警，請關閉電源！
17= SPI激光器准直雷射器報警，請關閉電源！
18= SPI雷射器保留報警，請關閉電源！
19= SPI激光器電源報警，請關閉電源！
20= 雷射器未知報警，請關閉電源！
21= 雷射器電源過流報警，請關閉電源！
22= 雷射器電源過壓報警，請關閉電源！
23= 激光器電源過溫報警，請關閉電源並檢查散熱條件！
24= 雷射器電源未打開，請檢查電源。
30= 運動過程中碰到負限位，打標被中止！
31= 運動過程中碰到正限位，打標被中止！
32= 電機脈衝超範圍
33= 振鏡DA超範圍！
34= 平臺X軸超正限位！
35= 平臺X軸超負限位！
36= 平臺Y軸超正限位！
37= 平臺Y軸超負限位！
38= 振鏡方頭上電異常，請關閉電源並檢查！
54=請切換到512校正表！
55=請切換到128校正表！
100=安全門有效且被打開！

110=碰到負限位！
111=碰到正限位！
112=運動中碰到原點！
500=振鏡預熱中，請稍侯再試！

[door]
1=安全門被打開，請關上安全門！
2=安全門被打開，打標暫停，請關上安全門繼續打標！
3=安全門被打開，打標中止！
4=安全門已關上，可以繼續打標！
5=安全門已關上，狀態正常！
6=運動過程中碰到負限位，打標被中止！
7=運動過程中碰到正限位，打標被中止！ 
[usb]
1=EMCC卡已經連接
2=EMCC卡已經斷開

[4101]
3=DA卡1功能與版本資訊
4=DA卡1版本日期資訊
5=DA卡1的運行時間
7=DA卡1的誤碼幀數
9=DA卡1倒數第4次誤碼的時間
11=DA卡1倒數第3次誤碼的時間
13=DA卡1倒數第2次誤碼的時間
15=DA卡1最後一次誤碼的時間

[4102]
4=DA卡1的失碼幀數
6=DA卡1倒數第4次失碼的時間
8=DA卡1倒數第3次失碼的時間
10=DA卡1倒數第2次失碼的時間
12=DA卡1最後一次失碼的時間
14=DA卡1振鏡報警資訊
15=DA卡1振鏡報警關鐳射使能

[4103]
3=DA卡2功能與版本資訊
4=DA卡2版本日期資訊
5=DA卡2的運行時間
7=DA卡2的誤碼幀數
9=DA卡2倒數第4次誤碼的時間
11=DA卡2倒數第3次誤碼的時間
13=DA卡2倒數第2次誤碼的時間
15=DA卡2最後一次誤碼的時間

[4104]
4=DA卡2的失碼幀數
6=DA卡2倒數第4次失碼的時間
8=DA卡2倒數第3次失碼的時間
10=DA卡2倒數第2次失碼的時間
12=DA卡2最後一次失碼的時間
14=DA卡2振鏡報警資訊
15=DA卡2振鏡報警關鐳射使能

[4105]
3=LASER卡功能與版本資訊
4=LASER卡版本日期資訊
5=LASER卡的運行時間
7=LASER卡的誤碼幀數
9=LASER卡倒數第4次誤碼的時間
11=LASER卡倒數第3次誤碼的時間
13=LASER卡倒數第2次誤碼的時間
15=LASER卡最後一次誤碼的時間

[4106]
4=LASER卡的失碼幀數
6=LASER卡倒數第4次失碼的時間
8=LASER卡倒數第3次失碼的時間
10=LASER卡倒數第2次失碼的時間
12=LASER卡最後一次失碼的時間
14=LASER卡振鏡報警資訊
15=LASER卡激光器報警關鐳射使能

[4107]
3=LASER卡激光器當前ns波形
4=LASER卡激光器當前ps波形
5=LASER卡激光器當前fs波形
6=LASER卡激光器當前維持功率

[4102Warning]
0=D0：DA卡1 數據通訊異常
1=D1：DA卡1 Scanner系統報警
2=D2：DA卡1 Scanner溫度報警
3=D3：DA卡1 Scanner低速報警
4=D4：未使用
5=D5：未使用
6=D6：未使用
7=D7：未使用
8=D8：未使用
9=D9：未使用
10=D10：未使用
11=D11：未使用
12=D12：未使用
13=D13：未使用
14=D14：未使用
15=D15：EMCC卡 數據通訊異常

[4104Warning]
0=D0：DA卡2 數據通訊異常
1=D1：DA卡2 Scanner系統報警
2=D2：DA卡2 Scanner溫度報警
3=D3：DA卡2 Scanner低速報警
4=D4：未使用
5=D5：未使用
6=D6：未使用
7=D7：未使用
8=D8：未使用
9=D9：未使用
10=D10：未使用
11=D11：未使用
12=D12：未使用
13=D13：未使用
14=D14：未使用
15=D15：未使用

[4106Warning]
0=D0：LASER卡 數據通訊異常
1=D1：激光器溫度報警
2=D2：電源報警
3=D3：系統報警
4=D4：高反報警
5=D5：雷射器未準備好
6=D6：種子激光點火失敗
7=D7：種子激光溫度報警
8=D8：MO過流報警
9=D9：PA過流報警
10=D10：准直器報警
11=D11：保留報警5
12=D12：保留報警4
13=D13：保留報警3
14=D14：保留報警2
15=D15：保留報警1

[Refresh]
Interval=500
